export const why_me = [
    {
        name: "Миттєва генерація",
        desc: "Отримай інтер’єр вже за кілька секунд після запиту — швидко, без очікувань.",
    },
    {
        name: "Індивіальний стиль",
        desc: "ШІ адаптує дизайн під твій простір, стиль і побажання — без банальних шаблонів.",
    },
    {
        name: "Генерація з фото",
        desc: "Завантаж фото своєї кімнати — і побач варіант оновлення саме для неї.",
    },
    {
        name: "Простий prompt",
        desc: "Отримай інтер’єр вже за кілька секунд після запиту — швидко, без очікувань.",
    },
    {
        name: "Збереження та редагування",
        desc: "Повернись до згенерованих варіантів у будь-який момент — і вдоскональ їх.",
    },
    {
        name: "Універсальний доступ",
        desc: "Користуйся з комп’ютера, телефону чи планшета. Інтерфейс адаптовано під усе.",
    },
]

export const design_list = [
    {
        name: "Класичний",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Лофт",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Скандинавський",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Мінімалізм ",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Модерн",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Контемпорарі",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Японський",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Середземноморський",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Ар-деко",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Еко-стиль",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Хай-тек",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Прованс",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
]

export const steps = [
    {
      title: "Завантажуй фото кімнати",
      desc: "Додай фото кімнати для створення персонального дизайну"
    },
    {
      title: "Опиши свій запит в деталях",
      desc: "Напиши prompt зі своїми побажаннями в деталях"
    },
    {
      title: "Обери стиль і тип кімнати",
      desc: "Вкажи стиль інтер’єру та тип приміщення для точнішого результату"
    },
    {
      title: "Отримай згенероване рішення",
      desc: "Готовий дизайн — перший крок до інтер’єру твоєї мрії"
    }
];