import photo1 from "@/assets/gallery/0.png"
import photo2 from "@/assets/gallery/1.png"
import photo3 from "@/assets/gallery/2.png"
import photo4 from "@/assets/gallery/3.png"
import photo5 from "@/assets/gallery/4.png"
import photo6 from "@/assets/gallery/5.png"
import photo7 from "@/assets/gallery/6.png"
import photo8 from "@/assets/gallery/7.png"
import photo9 from "@/assets/gallery/8.png"
import photo10 from "@/assets/gallery/9.png"
import photo11 from "@/assets/gallery/10.png"
import photo12 from "@/assets/gallery/11.png"

import clock from "@/assets/why_me/clock.svg"
import sofa from "@/assets/why_me/sofa.svg"
import image from "@/assets/why_me/image.svg"
import file from "@/assets/why_me/file.svg"
import folder from "@/assets/why_me/folder.svg"
import pc from "@/assets/why_me/pc.svg"


export const why_me = [
    {
        name: "Миттєва генерація",
        desc: "Отримай інтер’єр вже за кілька секунд після запиту — швидко, без очікувань",
        img: clock
    },
    {
        name: "Індивіальний стиль",
        desc: "ШІ адаптує дизайн під твій простір, стиль і побажання — без банальних шаблонів",
        img: sofa
    },
    {
        name: "Персональний дизайн",
        desc: "Завантаж фото своєї кімнати і отримай варіант оновлення саме для неї",
        img: image
    },
    {
        name: "Простий prompt",
        desc: "Тобі не потрібно вигадувати складні промпти, просто опиши, що ти хочеш",
        img: file
    },
    {
        name: "Збереження в папки",
        desc: "Зберігай згенеровані результати в папках і швидко знаходь потрібне",
        img: folder
    },
    {
        name: "Універсальний доступ",
        desc: "Користуйся з комп’ютера, телефону або планшета, інтерфейс адаптований під усі пристрої",
        img: pc
    },
]

export const design_list = [
    {
        name: "Класичний",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Лофт",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Скандинавський",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Мінімалізм ",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Модерн",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Контемпорарі",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Японський",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Середземноморський",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Ар-деко",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Еко-стиль",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Хай-тек",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
    {
        name: "Прованс",
        desc: "Cтиль з характером: відкриті простори, високі стелі, цегляні стіни та металеві акценти. Відчуття свободи і міського духу."
    },
]

export const steps = [
    {
      title: "Завантаж фото",
      desc: "Додай фото кімнати для створення персонального дизайну."
    },
    {
      title: "Налаштуй параметри",
      desc: "Обери з переліку тип кімнати, стиль, напиши простий промпт та натисни кнопку “Згенерувати”."
    },
    {
      title: "Генерація інтер’єру",
      desc: "Зачекай декілька секунд та отримай картинку згенерованого простору відповідно до твого запиту."
    },
    {
      title: "Збереження картинки",
      desc: "Завантажуй собі на телефон чи комп’ютер або зберігай готовий інтер’єр на сайті в окремі папки. За бажанням ділись з друзями."
    }
];

export const gallery = [
    photo1,
    photo2,
    photo3,
    photo4,
    photo5,
    photo6,
    photo7,
    photo8,
    photo9,
    photo10,
    photo11,
    photo12,
]

export const comment = [
    {
        name: "Андрій Мельник",
        date: "24.05.2025",
        desc: "Я не є професіоналом у дизайні, але завдяки цій платформі я зміг створити інтер'єр для своєї квартири, який справді відображає мої вподобання. Це неймовірно просто — я просто вказав свої побажання, а результат був точно таким, як я уявляв. Велика подяка за такий зручний і інтуїтивно зрозумілий інструмент!",
    },
    {
        name: "Олена Ковальчук",
        date: "20.05.2025",
        desc: "Ця платформа значно спростила процес створення дизайну. Завдяки різноманітним шаблонам і можливості налаштувати кожен елемент, я змогла легко візуалізувати свій ідеальний інтер’єр. Дійсно зручний інструмент для всіх, хто хоче швидко отримати результат!",
    },
    {
        name: "Софія Литвин",
        date: "19.05.2025",
        desc: "Я була вражена тим, наскільки просто працювати з платформою! Вона дозволяє експериментувати з різними стилями і кольорами, не витрачаючи багато часу. Це справжній помічник для створення неповторного інтер'єру без професійних навичок",
    },
]