export const subscribes = [
  {
    title: "free",
    id: "free",
    price: 0,
    feauters: [
      "10 генерацій інтер’єрів загалом",
      "Черга на генерацію",
      "Обмежений доступ до ресурсів",
      "Для некомерційного використання",
    ],
  },
  {
    title: "Premium",
    id: "premium",
    price: 5.99,
    feauters: [
      "50 генерацій інтер’єрів загалом",
      "Без черги на генерацію",
      "Обмежений доступ до ресурсів",
      "Для некомерційного використання",
    ],
  },
  {
    title: "PRO",
    id: "pro",
    price: 9.99,
    feauters: [
      "безлімітна кількість генерацій",
      "Без черги на генерацію",
      "Обмежений доступ до ресурсів",
      "Для некомерційного використання",
    ],
  },
];
