const subcriptions = [
  {
    plan: "free",
    price: "0",
    privilegies: [
      "5 генерацій інтер’єрів загалом",
      "Чергування на генерацію",
      "Обмежений доступ до ресурсів",
      "Для некомерційного використання",
    ],
  },
  {
    plan: "premium",
    price: "5.99",
    privilegies: [
      "50 генерацій інтер’єрів загалом",
      "Не має ергування на генерацію",
      "Обмежений доступ до ресурсів",
      "Для некомерційного використання",
    ],
  },
  {
    plan: "pro",
    price: "9.99",
    privilegies: [
      "безлімітна кількість генерацій",
      "Не має ергування на генерацію",
      "Обмежений доступ до ресурсів",
      "Для некомерційного використання",
    ],
  },
];
